## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/5723643737)



<pre><code>Plan: 36 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_creator
  * module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder
  * module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder
  * module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner
  * module.secrets_leaks_log_scanner.google_eventarc_trigger.secrets_leak_detector_workflow
  * module.secrets_leaks_log_scanner.google_monitoring_alert_policy.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_monitoring_alert_policy.github_issue_creator
  * module.secrets_leaks_log_scanner.google_monitoring_alert_policy.github_issue_finder
  * module.secrets_leaks_log_scanner.google_monitoring_alert_policy.secrets_leak_log_scanner
  * module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer
  * module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker
  * module.secrets_leaks_log_scanner.google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor
  * module.secrets_leaks_log_scanner.google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor
  * module.secrets_leaks_log_scanner.google_service_account.gcs_bucket_mover
  * module.secrets_leaks_log_scanner.google_service_account.github_issue_creator
  * module.secrets_leaks_log_scanner.google_service_account.github_issue_finder
  * module.secrets_leaks_log_scanner.google_service_account.secrets_leak_detector
  * module.secrets_leaks_log_scanner.google_service_account.secrets_leak_log_scanner
  * module.secrets_leaks_log_scanner.google_storage_bucket.kyma_prow_logs_secured
  * module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.kyma_prow_logs_object_admin
  * module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.kyma_prow_logs_secured_object_admin
  * module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.kyma_prow_logs_viewer
  * module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.secrets_leak_detector
  * module.secrets_leaks_log_scanner.google_workflows_workflow.secrets_leak_detector
  * module.slack_message_sender.google_cloud_run_service.slack_message_sender
  * module.slack_message_sender.google_cloud_run_service_iam_policy.slack_message_sender
  * module.slack_message_sender.google_eventarc_trigger.release_cluster_created
  * module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender
  * module.slack_message_sender.google_project_iam_member.project_workflows_invoker
  * module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor
  * module.slack_message_sender.google_service_account.release_cluster_created
  * module.slack_message_sender.google_service_account.slack_message_sender



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.secrets_leaks_log_scanner.data.google_iam_policy.run_invoker will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "run_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + (known after apply),
            ]
          + role    = "roles/run.invoker"
        }
    }

  # module.secrets_leaks_log_scanner.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_secret_manager_secret.gh_tools_kyma_bot_token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret" "gh_tools_kyma_bot_token" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = (known after apply)
      + replication = (known after apply)
      + rotation    = (known after apply)
      + secret_id   = "trusted_default_kyma-bot-github-sap-token"
      + topics      = (known after apply)
      + ttl         = (known after apply)
    }

  # module.secrets_leaks_log_scanner.data.google_storage_bucket.kyma_prow_logs will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_storage_bucket" "kyma_prow_logs" {
      + autoclass                   = (known after apply)
      + cors                        = (known after apply)
      + custom_placement_config     = (known after apply)
      + default_event_based_hold    = (known after apply)
      + encryption                  = (known after apply)
      + force_destroy               = (known after apply)
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + lifecycle_rule              = (known after apply)
      + location                    = (known after apply)
      + logging                     = (known after apply)
      + name                        = "kyma-prow-logs"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + requester_pays              = (known after apply)
      + retention_policy            = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
      + versioning                  = (known after apply)
      + website                     = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.gcs_bucket_mover will be created
  + resource "google_cloud_run_service" "gcs_bucket_mover" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "gcs-bucket-mover"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/movegcsbucket:v20230309-1d421c4f"
                  + name  = (known after apply)

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "secrets-leaks-detector"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "gcs-bucket-mover"
                    }
                  + env {
                      + name  = "DRY_RUN"
                      + value = "true"
                    }
                  + env {
                      + name  = "DST_BUCKET_NAME"
                      + value = "kyma-prow-logs-secured"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                }
            }
        }
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_creator will be created
  + resource "google_cloud_run_service" "github_issue_creator" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "github-issue-creator"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/creategithubissue:v20230309-1d421c4f"
                  + name  = (known after apply)

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "github-kyma-bot"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "github-issue-creator"
                    }
                  + env {
                      + name  = "GITHUB_ORG"
                      + value = "neighbors-team"
                    }
                  + env {
                      + name  = "GITHUB_REPO"
                      + value = "leaks-test"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "TOOLS_GITHUB_TOKEN_PATH"
                      + value = "/etc/gh-token/trusted_default_kyma-bot-github-sap-token"
                    }

                  + volume_mounts {
                      + mount_path = "/etc/gh-token"
                      + name       = "gh-tools-kyma-bot-token"
                    }
                }

              + volumes {
                  + name = "gh-tools-kyma-bot-token"

                  + secret {
                      + secret_name = "trusted_default_kyma-bot-github-sap-token"
                    }
                }
            }
        }
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.github_issue_finder will be created
  + resource "google_cloud_run_service" "github_issue_finder" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "github-issue-finder"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/searchgithubissue:v20230309-1d421c4f"
                  + name  = (known after apply)

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "secrets-leaks-detector"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "github-issue-finder"
                    }
                  + env {
                      + name  = "GITHUB_ORG"
                      + value = "neighbors-team"
                    }
                  + env {
                      + name  = "GITHUB_REPO"
                      + value = "leaks-test"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "TOOLS_GITHUB_TOKEN_PATH"
                      + value = "/etc/gh-token/trusted_default_kyma-bot-github-sap-token"
                    }

                  + volume_mounts {
                      + mount_path = "/etc/gh-token"
                      + name       = "gh-tools-kyma-bot-token"
                    }
                }

              + volumes {
                  + name = "gh-tools-kyma-bot-token"

                  + secret {
                      + secret_name = "trusted_default_kyma-bot-github-sap-token"
                    }
                }
            }
        }
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service.secrets_leak_log_scanner will be created
  + resource "google_cloud_run_service" "secrets_leak_log_scanner" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "secrets-leak-log-scanner"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/scanlogsforsecrets:v20230309-1d421c4f"
                  + name  = (known after apply)

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "secrets-leaks-detector"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "secrets-leak-log-scanner"
                    }
                  + env {
                      + name  = "LISTEN_PORT"
                      + value = "8080"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                }
            }
        }
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.gcs_bucket_mover will be created
  + resource "google_cloud_run_service_iam_policy" "gcs_bucket_mover" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "gcs-bucket-mover"
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_creator will be created
  + resource "google_cloud_run_service_iam_policy" "github_issue_creator" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "github-issue-creator"
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.github_issue_finder will be created
  + resource "google_cloud_run_service_iam_policy" "github_issue_finder" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "github-issue-finder"
    }

  # module.secrets_leaks_log_scanner.google_cloud_run_service_iam_policy.secrets_leak_log_scanner will be created
  + resource "google_cloud_run_service_iam_policy" "secrets_leak_log_scanner" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "secrets-leak-log-scanner"
    }

  # module.secrets_leaks_log_scanner.google_eventarc_trigger.secrets_leak_detector_workflow will be created
  + resource "google_eventarc_trigger" "secrets_leak_detector_workflow" {
      + conditions      = (known after apply)
      + create_time     = (known after apply)
      + etag            = (known after apply)
      + id              = (known after apply)
      + labels          = {
          + "application" = "secrets_leak_detector"
        }
      + location        = "europe-west3"
      + name            = "secrets-leak-detector"
      + project         = (known after apply)
      + service_account = (known after apply)
      + uid             = (known after apply)
      + update_time     = (known after apply)

      + destination {
          + workflow = (known after apply)
        }

      + matching_criteria {
          + attribute = "type"
          + value     = "google.cloud.pubsub.topic.v1.messagePublished"
        }

      + transport {
          + pubsub {
              + subscription = (known after apply)
              + topic        = "projects/sap-kyma-prow/topics/prowjobs"
            }
        }
    }

  # module.secrets_leaks_log_scanner.google_monitoring_alert_policy.gcs_bucket_mover will be created
  + resource "google_monitoring_alert_policy" "gcs_bucket_mover" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "gcs-bucket-mover-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "gcs-bucket-mover"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=gcs-bucket-mover AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # module.secrets_leaks_log_scanner.google_monitoring_alert_policy.github_issue_creator will be created
  + resource "google_monitoring_alert_policy" "github_issue_creator" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "github-issue-creator-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "github-issue-creator"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=github-issue-creator AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # module.secrets_leaks_log_scanner.google_monitoring_alert_policy.github_issue_finder will be created
  + resource "google_monitoring_alert_policy" "github_issue_finder" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "github-issue-finder-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "github-issue-finder"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=github-issue-finder AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # module.secrets_leaks_log_scanner.google_monitoring_alert_policy.secrets_leak_log_scanner will be created
  + resource "google_monitoring_alert_policy" "secrets_leak_log_scanner" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "secrets-leak-log-scanner-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "secrets-leak-detector"
          + "component" = "secrets-leak-log-scanner"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=secrets-leak-log-scanner AND labels.io.kyma.app=secrets-leaks-detector"
            }
        }
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_log_writer will be created
  + resource "google_project_iam_member" "project_log_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.logWriter"
    }

  # module.secrets_leaks_log_scanner.google_project_iam_member.project_workflows_invoker will be created
  + resource "google_project_iam_member" "project_workflows_invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/workflows.invoker"
    }

  # module.secrets_leaks_log_scanner.google_secret_manager_secret_iam_member.gh_issue_creator_gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_issue_creator_gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # module.secrets_leaks_log_scanner.google_secret_manager_secret_iam_member.gh_issue_finder_gh_tools_kyma_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "gh_issue_finder_gh_tools_kyma_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "trusted_default_kyma-bot-github-sap-token"
    }

  # module.secrets_leaks_log_scanner.google_service_account.gcs_bucket_mover will be created
  + resource "google_service_account" "gcs_bucket_mover" {
      + account_id  = "gcs-bucket-mover"
      + description = "Identity of cloud run instance running gcs bucket mover service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_service_account.github_issue_creator will be created
  + resource "google_service_account" "github_issue_creator" {
      + account_id  = "github-issue-creator"
      + description = "Identity of cloud run instance running github issue creator service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_service_account.github_issue_finder will be created
  + resource "google_service_account" "github_issue_finder" {
      + account_id  = "github-issue-finder"
      + description = "Identity of cloud run instance running github issue finder service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_service_account.secrets_leak_detector will be created
  + resource "google_service_account" "secrets_leak_detector" {
      + account_id  = "secrets-leak-detector"
      + description = "Identity of secrets leak detector application."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_service_account.secrets_leak_log_scanner will be created
  + resource "google_service_account" "secrets_leak_log_scanner" {
      + account_id  = "secrets-leak-log-scanner"
      + description = "Identity of cloud run instance running log scanner service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.secrets_leaks_log_scanner.google_storage_bucket.kyma_prow_logs_secured will be created
  + resource "google_storage_bucket" "kyma_prow_logs_secured" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EU"
      + name                        = "kyma-prow-logs-secured"
      + project                     = (known after apply)
      + public_access_prevention    = "enforced"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + custom_placement_config {
          + data_locations = [
              + "EUROPE-WEST1",
              + "EUROPE-WEST4",
            ]
        }
    }

  # module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.kyma_prow_logs_object_admin will be created
  + resource "google_storage_bucket_iam_member" "kyma_prow_logs_object_admin" {
      + bucket = "kyma-prow-logs"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.kyma_prow_logs_secured_object_admin will be created
  + resource "google_storage_bucket_iam_member" "kyma_prow_logs_secured_object_admin" {
      + bucket = "kyma-prow-logs-secured"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.kyma_prow_logs_viewer will be created
  + resource "google_storage_bucket_iam_member" "kyma_prow_logs_viewer" {
      + bucket = "kyma-prow-logs"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.secrets_leaks_log_scanner.google_storage_bucket_iam_member.secrets_leak_detector will be created
  + resource "google_storage_bucket_iam_member" "secrets_leak_detector" {
      + bucket = "kyma-prow-logs"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.secrets_leaks_log_scanner.google_workflows_workflow.secrets_leak_detector will be created
  + resource "google_workflows_workflow" "secrets_leak_detector" {
      + create_time     = (known after apply)
      + description     = "Workflow is triggered by message published to prowjobs PubSub topic and scans prowjobs logs for secrets."
      + id              = (known after apply)
      + name            = "secrets-leak-detector"
      + name_prefix     = (known after apply)
      + project         = (known after apply)
      + region          = "europe-west3"
      + revision_id     = (known after apply)
      + service_account = (known after apply)
      + source_contents = (known after apply)
      + state           = (known after apply)
      + update_time     = (known after apply)
    }

  # module.slack_message_sender.data.google_iam_policy.run_invoker will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "run_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + (known after apply),
            ]
          + role    = "roles/run.invoker"
        }
    }

  # module.slack_message_sender.google_cloud_run_service.slack_message_sender will be created
  + resource "google_cloud_run_service" "slack_message_sender" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west3"
      + name                       = "slack-message-sender"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = {
              + "run.googleapis.com/client-name" = "terraform"
            }
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "europe-docker.pkg.dev/kyma-project/prod/test-infra/slackmessagesender:v20230309-1d421c4f"
                  + name  = (known after apply)

                  + env {
                      + name  = "APPLICATION_NAME"
                      + value = "slack-kyma-bot"
                    }
                  + env {
                      + name  = "COMPONENT_NAME"
                      + value = "slack-message-sender"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "sap-kyma-prow"
                    }
                  + env {
                      + name  = "SLACK_BASE_URL"
                      + value = "https://slack.com/api"
                    }
                  + env {
                      + name  = "SLACK_CHANNEL_ID"
                      + value = "C01KSP10MB5"
                    }
                  + env {
                      + name  = "SLACK_RELEASE_CHANNEL_ID"
                      + value = "C01KKPXCPK8"
                    }
                  + env {
                      + name  = "SLACK_TOKEN_PATH"
                      + value = "/etc/slack-secret/common-slack-bot-token"
                    }

                  + volume_mounts {
                      + mount_path = "/etc/slack-secret"
                      + name       = "slack-token"
                    }
                }

              + volumes {
                  + name = "slack-token"

                  + secret {
                      + secret_name = "common-slack-bot-token"
                    }
                }
            }
        }
    }

  # module.slack_message_sender.google_cloud_run_service_iam_policy.slack_message_sender will be created
  + resource "google_cloud_run_service_iam_policy" "slack_message_sender" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west3"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "slack-message-sender"
    }

  # module.slack_message_sender.google_eventarc_trigger.release_cluster_created will be created
  + resource "google_eventarc_trigger" "release_cluster_created" {
      + conditions      = (known after apply)
      + create_time     = (known after apply)
      + etag            = (known after apply)
      + id              = (known after apply)
      + labels          = {
          + "application" = "release_cluster_created"
        }
      + location        = "europe-west3"
      + name            = "release-cluster-created"
      + project         = (known after apply)
      + service_account = (known after apply)
      + uid             = (known after apply)
      + update_time     = (known after apply)

      + destination {
          + cloud_run_service {
              + path    = "/release-cluster-created"
              + region  = "europe-west3"
              + service = "slack-message-sender"
            }
        }

      + matching_criteria {
          + attribute = "type"
          + value     = "google.cloud.pubsub.topic.v1.messagePublished"
        }

      + transport {
          + pubsub {
              + subscription = (known after apply)
              + topic        = "projects/sap-kyma-prow/topics/release-cluster-created"
            }
        }
    }

  # module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender will be created
  + resource "google_monitoring_alert_policy" "slack_message_sender" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "slack-message-sender-error-logged"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/sap-kyma-prow/notificationChannels/5909844679104799956",
        ]
      + project               = (known after apply)
      + user_labels           = {
          + "app"       = "slack-messagesender"
          + "component" = "slack-message-sender"
        }

      + alert_strategy {
          + auto_close = "345600s"

          + notification_rate_limit {
              + period = "21600s"
            }
        }

      + conditions {
          + display_name = "error-log-message"
          + name         = (known after apply)

          + condition_matched_log {
              + filter = "resource.type=cloud_run_revision AND severity>=ERROR AND jsonPayload.component=slack-message-sender"
            }
        }
    }

  # module.slack_message_sender.google_project_iam_member.project_workflows_invoker will be created
  + resource "google_project_iam_member" "project_workflows_invoker" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/workflows.invoker"
    }

  # module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor will be created
  + resource "google_secret_manager_secret_iam_member" "slack_msg_sender_common_slack_bot_token_accessor" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "common-slack-bot-token"
    }

  # module.slack_message_sender.google_service_account.release_cluster_created will be created
  + resource "google_service_account" "release_cluster_created" {
      + account_id  = "release-cluster-created"
      + description = "Identity of release cluster created eventarc."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.slack_message_sender.google_service_account.slack_message_sender will be created
  + resource "google_service_account" "slack_message_sender" {
      + account_id  = "slack-message-sender"
      + description = "Identity of cloud run instance running slack message sender service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

Plan: 36 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":8470,"Program":"tfcmt","SHA1":"6c5205aac48850367b5c485f896f3085f01af616","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->